app/models/user.rb

    def self.find_by_credentials(email, password)
        @user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "james.berke@gmail.com"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "b8teAhi3yxltfBiRR6oWpQ"], ["updated_at", "2020-03-03 20:08:46.828364"], ["id", 3]]