app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "demouser@gmail.com"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, password)
        @user = User.find_by(email: email)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "pFoCsmi3BwhMiQU6i3YOHA"], ["updated_at", "2020-03-05 19:04:55.395551"], ["id", 3]]
---
    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save!